tutorials/basic/simpleFoam/3D/Non_Periodic_Tilted_Cylinders/Velocity_X_Direction/system/pressureDifferencePatch1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the difference between the average pressures on 2 specified
    patches.

\*---------------------------------------------------------------------------*/

patch1 wall_effective_y2;
patch2 wall_effective_y1;

#includeEtc "caseDicts/postProcessing/pressure/pressureDifferencePatch.cfg"

// ************************************************************************* //
