tutorials/basic/simpleFoam/3D/Non_Periodic_Tilted_Cylinders/Velocity_X_Direction/system/pressureDifferenceSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Interpolates pressures onto 2 specified triangulated surfaces and
    calculates the difference between the average pressures.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/pressure/pressureDifference.cfg"

region1
{
    regionType sampledSurface;
    name outlet;
    type surfaceFieldValue;

    sampledSurfaceDict
    {
        type            plane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            basePoint    (1.5001e-6 0 0);
            normalVector (1 0 0);
        }
    }
}

region2
{
    regionType sampledSurface;
    name inlet;
    type surfaceFieldValue;

    sampledSurfaceDict
    {
        type            plane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            basePoint    (0.4999e-6 0 0);
            normalVector (1 0 0);
        }
    }
}

// ************************************************************************* //
