tutorials/basic/simpleFoam/3D/Non_Periodic_Tilted_Cylinders/Velocity_X_Direction/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       dictionary;
  object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "sphere.obj"
);

// Identify edges when angle between faces < includedAngle
includedAngle       120;

// Include region boundaries as features
geometricTestOnly   no;

subsetFeatures {
  // Include nonManifold edges (edges with >2 connected faces)
  nonManifoldEdges    yes;

  // Include open edges (edges with 1 connected face)
  openEdges           yes;
}

trimFeatures {
  // Remove features with fewer than the specified number of edges
  minElem         0;

  // Remove features shorter than the specified cumulative length
  minLen          0.0;
}

// Write features to obj format for visualisation
writeObj            yes;
verboseObj          no;


// ************************************************************************* //
